Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.AnalyticalModelSurface,System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new hosted line load within the project.
aDoc:
Document to which new line load will be added.
host:
The analytical model surface host element for the line Load.
curveIndex:
The index of a curve in analytical surface element.
Use Autodesk::Revit::DB::Structure::AnalyticalModelSurface::GetLoops method to obtain appropriate curve index.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2016